src/Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УстановкаЦенНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеПроводитьНулевыеЗначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f7e45c4-ad85-4100-870c-63a57ffb2fe9">
    <name>Информация</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/УстановкаЦенНоменклатуры/ManagerModule.bsl
&Вместо("ВремяДокументаПоУмолчанию")
Функция Базар_ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 8, 30);
	
КонецФункции

&Вместо("ТекстЗапросаУстановкаЦен")
Функция Базар_ТекстЗапросаУстановкаЦен(НомераТаблиц)
	
	НомераТаблиц.Вставить("УстановкаЦен", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	УстановкаЦенНоменклатурыТовары.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА УстановкаЦенНоменклатурыТовары.Валюта <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА УстановкаЦенНоменклатурыТовары.Валюта
	|		КОГДА УстановкаЦенНоменклатуры.ТипЦен.ВалютаЦены <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА УстановкаЦенНоменклатуры.ТипЦен.ВалютаЦены
	|		ИНАЧЕ &ВалютаРегламентированногоУчета
	|	КОНЕЦ КАК Валюта
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|		ПО УстановкаЦенНоменклатурыТовары.Ссылка = УстановкаЦенНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО УстановкаЦенНоменклатурыТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И (ЦеныНоменклатуры.Период МЕЖДУ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&Ссылка КАК Документ.УстановкаЦенНоменклатуры).Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(ВЫРАЗИТЬ(&Ссылка КАК Документ.УстановкаЦенНоменклатуры).Дата, ДЕНЬ))
	|			И (ЦеныНоменклатуры.Регистратор <> &Ссылка)
	|			И (ЦеныНоменклатуры.ТипЦен = ВЫРАЗИТЬ(&Ссылка КАК Документ.УстановкаЦенНоменклатуры).ТипЦен)
	|ГДЕ
	|	НЕ(&НеПроводитьНулевыеЗначения
	|				И УстановкаЦенНоменклатурыТовары.Цена = 0)
	|	И УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
	|	И ЦеныНоменклатуры.Номенклатура ЕСТЬ NULL";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции // ТекстЗапросаРеквизитыДокумента()
